app/controllers/soundcloud_controller.rb

  def connected
    if params[:error].nil?
      soundcloud_client.exchange_token(:code => params[:code])
      me = soundcloud_client.get("/me")

      login_as User.find_or_create_by_soundcloud_user_id({
        :soundcloud_user_id  => me.id,
        :soundcloud_username => me.username
      })

      current_user.update_attributes!({
        :soundcloud_access_token  => soundcloud_client.access_token,
        :soundcloud_refresh_token => soundcloud_client.refresh_token,
        :soundcloud_expires_at    => soundcloud_client.expires_at,
      })
---
INSERT INTO `users` (`created_at`, `soundcloud_access_token`, `soundcloud_expires_at`, `soundcloud_refresh_token`, `soundcloud_user_id`, `soundcloud_username`, `updated_at`) VALUES ('2014-08-26 20:38:06', NULL, NULL, NULL, 104173245, 'vishalkirandesai', '2014-08-26 20:38:06')
SELECT `users`.* FROM `users` WHERE `users`.`soundcloud_user_id` = 104173245 LIMIT 1
UPDATE `users` SET `soundcloud_access_token` = '1-93782-104173245-de558ddffe82b0', `soundcloud_refresh_token` = 'a5a16499c35990aaeeb7f3a1f56c84ee', `soundcloud_expires_at` = '2014-08-27 02:38:05', `updated_at` = '2014-08-26 20:38:06' WHERE `users`.`id` = 1